#coding=utf-8

import os
from db.batch import Batch

batch_order = [u'本科提前A_1',u'本科提前A_2',u'本科提前A_3',u'本科提前B_1',u'本科提前B_2',u'专科提前_1',
     u'本科一批_1',u'本科一批_2',u'本科一批B_1',u'本科一批B_2',
     u'本科二批_1',u'本科二批_2',u'本科二批_3',u'本科二批B_1',u'本科二批B_2',u'本科二批B_3',
     u'专科提前、高职高专_1',u'专科提前、高职高专_2',u'专科提前、高职高专_3']

tasks = {
    # 提前批
    u'本科提前A_1': {
        u'普通文科': '../../data/zy_1_1_2017/1_A_10.html',
        u'普通理科': '../../data/zy_1_1_2017/1_B_10.html',
        u'蒙授文科': '../../data/zy_1_1_2017/1_C_10.html',
        u'蒙授理科': '../../data/zy_1_1_2017/1_D_10.html'},
    u'本科提前A_2':{
        u'普通文科': '../../data/zy_1_2_2017/1_A_3.html',
        u'普通理科': '../../data/zy_1_2_2017/1_B_3.html',
    },
    u'本科提前A_3':{
        u'普通文科': '../../data/zy_1_3_2017/1_A_1.html',
        u'普通理科': '../../data/zy_1_3_2017/1_B_1.html',
    },

    u'本科提前B_1':{
        u'普通文科': '../../data/zy_2_1_2017/2_A_9.html',
        u'普通理科': '../../data/zy_2_1_2017/2_B_9.html',
        u'蒙授文科': '../../data/zy_2_1_2017/2_C_9.html',
        u'蒙授理科': '../../data/zy_2_1_2017/2_D_9.html'
    },
    u'本科提前B_2':{
        u'普通文科': '../../data/zy_2_2_2017/2_A_2.html',
        u'普通理科': '../../data/zy_2_2_2017/2_B_2.html',
        u'蒙授文科': '../../data/zy_2_2_2017/2_C_2.html',
        u'蒙授理科': '../../data/zy_2_2_2017/2_D_2.html'
    },

    u'专科提前_1':
    {
        u'普通文科': '../../data/zy_6_1_2017/6_A_10.html',
        u'普通理科': '../../data/zy_6_1_2017/6_B_10.html',
        u'蒙授文科': '../../data/zy_6_1_2017/6_C_10.html',
        u'蒙授理科': '../../data/zy_6_1_2017/6_D_10.html'
    },

    # 一本
    u'本科一批_1': {
        u'普通文科': '../../data/zy_3_1_2017/3_A_11.html',
        u'普通理科': '../../data/zy_3_1_2017/3_B_11.html',
        u'蒙授文科': '../../data/zy_3_1_2017/3_C_11.html',
        u'蒙授理科': '../../data/zy_3_1_2017/3_D_11.html',
    },
    u'本科一批_2': {
        u'普通文科': '../../data/zy_3_2_2017/3_A_3.html',
        u'普通理科': '../../data/zy_3_2_2017/3_B_3.html',
        u'蒙授文科': '../../data/zy_3_2_2017/3_C_3.html',
        u'蒙授理科': '../../data/zy_3_2_2017/3_D_3.html',
    },

    u'本科一批B_1':{
        u'普通文科': '../../data/zy_C_1_2017/C_A_3.html',
        u'普通理科': '../../data/zy_C_1_2017/C_B_3.html'
    },
    u'本科一批B_2':{
        u'普通文科': '../../data/zy_C_2_2017/C_A_1.html',
        u'普通理科': '../../data/zy_C_2_2017/C_B_1.html',
        u'蒙授文科': '../../data/zy_C_2_2017/C_C_1.html',
        u'蒙授理科': '../../data/zy_C_2_2017/C_D_1.html'
    },
    # 二本
    u'本科二批_1':{
        u'普通文科': '../../data/zy_4_1_2017/4_A_12.html',
        u'普通理科': '../../data/zy_4_1_2017/4_B_12.html',
        u'蒙授文科': '../../data/zy_4_1_2017/4_C_12.html',
        u'蒙授理科': '../../data/zy_4_1_2017/4_D_12.html',
        u'计算机类': '../../data/zy_4_1_2017/4_M_12.html',
        u'农学类': '../../data/zy_4_1_2017/4_N_12.html',
        u'牧医类': '../../data/zy_4_1_2017/4_O_12.html',
        u'财会类': '../../data/zy_4_1_2017/4_Q_12.html',
        u'美工设计类': '../../data/zy_4_1_2017/4_R_12.html',
        u'旅游类': '../../data/zy_4_1_2017/4_S_12.html',
        u'汽驾类': '../../data/zy_4_1_2017/4_T_12.html',
        u'建筑类': '../../data/zy_4_1_2017/4_U_12.html',
        u'机电类': '../../data/zy_4_1_2017/4_V_12.html',
        u'蒙牧医类': '../../data/zy_4_1_2017/4_W_12.html',
        u'化工类': '../../data/zy_4_1_2017/4_X_12.html',
        u'幼师类': '../../data/zy_4_1_2017/4_Y_12.html',
        u'医学类': '../../data/zy_4_1_2017/4_Z_12.html',
        u'采矿类': '../../data/zy_4_1_2017/4_1_12.html'

    },
    u'本科二批_2': {
        u'普通文科': '../../data/zy_4_2_2017/4_A_2.html',
        u'普通理科': '../../data/zy_4_2_2017/4_B_2.html',
        u'蒙授文科': '../../data/zy_4_2_2017/4_C_2.html',
        u'蒙授理科': '../../data/zy_4_2_2017/4_D_2.html',
        u'蒙牧医类': '../../data/zy_4_2_2017/4_W_2.html',
        u'医学类': '../../data/zy_4_2_2017/4_Z_2.html',
    },
    u'本科二批_3': {
        u'普通文科': '../../data/zy_4_3_2017/4_A_1.html',
        u'普通理科': '../../data/zy_4_3_2017/4_B_1.html',
        u'蒙授理科': '../../data/zy_4_3_2017/4_D_1.html',
    },

    u'本科二批B_1': {
        u'普通文科': '../../data/zy_E_1_2017/E_A_3.html',
        u'普通理科': '../../data/zy_E_1_2017/E_B_3.html'
    },
    u'本科二批B_2':{
        u'普通文科': '../../data/zy_E_2_2017/E_A_1.html',
        u'普通理科': '../../data/zy_E_2_2017/E_B_1.html'
    },
    u'本科二批B_3':{
        u'普通文科': '../../data/zy_E_3_2017/E_A_1.html',
        u'普通理科': '../../data/zy_E_3_2017/E_B_1.html'
    },

    # 专科
    u'专科提前、高职高专_1': {
        u'普通文科': '../../data/zy_61_71_2017/A_11.html',
        u'普通理科': '../../data/zy_61_71_2017/B_11.html',
        u'蒙授文科': '../../data/zy_61_71_2017/C_11.html',
        u'蒙授理科': '../../data/zy_61_71_2017/D_11.html',
        u'汉授美术': '../../data/zy_61_71_2017/E_11.html',
        u'蒙授美术': '../../data/zy_61_71_2017/F_11.html',
        u'汉授音乐': '../../data/zy_61_71_2017/G_11.html',
        u'蒙授音乐': '../../data/zy_61_71_2017/H_11.html',
        u'其他艺术': '../../data/zy_61_71_2017/I_11.html',
        u'蒙授其他艺术': '../../data/zy_61_71_2017/J_11.html',
        u'汉授编导': '../../data/zy_61_71_2017/@_11.html',
        u'汉授体育': '../../data/zy_61_71_2017/K_11.html',
        u'蒙授体育': '../../data/zy_61_71_2017/L_11.html',
        u'计算机类': '../../data/zy_61_71_2017/M_11.html',
        u'农学类': '../../data/zy_61_71_2017/N_11.html',
        u'牧医类': '../../data/zy_61_71_2017/O_11.html',
        u'烹饪类': '../../data/zy_61_71_2017/P_11.html',
        u'财会类': '../../data/zy_61_71_2017/Q_11.html',
        u'美工设计类': '../../data/zy_61_71_2017/R_11.html',
        u'旅游类': '../../data/zy_61_71_2017/S_11.html',
        u'汽驾类': '../../data/zy_61_71_2017/T_11.html',
        u'建筑类': '../../data/zy_61_71_2017/U_11.html',
        u'机电类': '../../data/zy_61_71_2017/V_11.html',
        u'蒙牧医类': '../../data/zy_61_71_2017/W_11.html',
        u'化工类': '../../data/zy_61_71_2017/X_11.html',
        u'幼师类': '../../data/zy_61_71_2017/Y_11.html',
        u'医学类': '../../data/zy_61_71_2017/Z_11.html',
        u'体育类': '../../data/zy_61_71_2017/0_11.html',
        u'采矿类': '../../data/zy_61_71_2017/1_11.html'
    },
    u'专科提前、高职高专_2': {
        u'普通文科': '../../data/zy_62_72_2017/A_3.html',
        u'普通理科': '../../data/zy_62_72_2017/B_3.html',
        u'蒙授文科': '../../data/zy_62_72_2017/C_3.html',
        u'蒙授理科': '../../data/zy_62_72_2017/D_3.html',
        u'汉授美术': '../../data/zy_62_72_2017/E_3.html',
        u'蒙授美术': '../../data/zy_62_72_2017/F_3.html',
        u'汉授音乐': '../../data/zy_62_72_2017/G_3.html',
        u'蒙授音乐': '../../data/zy_62_72_2017/H_3.html',
        u'其他艺术': '../../data/zy_62_72_2017/I_3.html',
        u'蒙授其他艺术': '../../data/zy_62_72_2017/J_3.html',
        u'汉授编导': '../../data/zy_62_72_2017/@_3.html',
        u'汉授体育': '../../data/zy_62_72_2017/K_3.html',
        u'蒙授体育': '../../data/zy_62_72_2017/L_3.html',
        u'计算机类': '../../data/zy_62_72_2017/M_3.html',
        u'农学类': '../../data/zy_62_72_2017/N_3.html',
        u'牧医类': '../../data/zy_62_72_2017/O_3.html',
        u'烹饪类': '../../data/zy_62_72_2017/P_3.html',
        u'财会类': '../../data/zy_62_72_2017/Q_3.html',
        u'美工设计类': '../../data/zy_62_72_2017/R_3.html',
        u'旅游类': '../../data/zy_62_72_2017/S_3.html',
        u'汽驾类': '../../data/zy_62_72_2017/T_3.html',
        u'建筑类': '../../data/zy_62_72_2017/U_3.html',
        u'机电类': '../../data/zy_62_72_2017/V_3.html',
        u'蒙牧医类': '../../data/zy_62_72_2017/W_3.html',
        u'化工类': '../../data/zy_62_72_2017/X_3.html',
        u'幼师类': '../../data/zy_62_72_2017/Y_3.html',
        u'医学类': '../../data/zy_62_72_2017/Z_3.html',
        u'采矿类': '../../data/zy_62_72_2017/1_3.html'
    },
    u'专科提前、高职高专_3': {
        u'普通文科': '../../data/zy_63_73_2017/A_1.html',
        u'普通理科': '../../data/zy_63_73_2017/B_1.html',
        u'蒙授文科': '../../data/zy_63_73_2017/C_1.html',
        u'蒙授理科': '../../data/zy_63_73_2017/D_1.html',
        u'汉授美术': '../../data/zy_63_73_2017/E_1.html',
        u'蒙授美术': '../../data/zy_63_73_2017/F_1.html',
        u'汉授音乐': '../../data/zy_63_73_2017/G_1.html',
        u'蒙授音乐': '../../data/zy_63_73_2017/H_1.html',
        u'其他艺术': '../../data/zy_63_73_2017/I_1.html',
        u'蒙授其他艺术': '../../data/zy_63_73_2017/J_1.html',
        u'汉授编导': '../../data/zy_63_73_2017/@_1.html',
        u'汉授体育': '../../data/zy_63_73_2017/K_1.html',
        u'蒙授体育': '../../data/zy_63_73_2017/L_1.html',
        u'计算机类': '../../data/zy_63_73_2017/M_1.html',
        u'农学类': '../../data/zy_63_73_2017/N_1.html',
        u'牧医类': '../../data/zy_63_73_2017/O_1.html',
        u'烹饪类': '../../data/zy_63_73_2017/P_1.html',
        u'财会类': '../../data/zy_63_73_2017/Q_1.html',
        u'美工设计类': '../../data/zy_63_73_2017/R_1.html',
        u'旅游类': '../../data/zy_63_73_2017/S_1.html',
        u'汽驾类': '../../data/zy_63_73_2017/T_1.html',
        u'建筑类': '../../data/zy_63_73_2017/U_1.html',
        u'机电类': '../../data/zy_63_73_2017/V_1.html',
        u'蒙牧医类': '../../data/zy_63_73_2017/W_1.html',
        u'化工类': '../../data/zy_63_73_2017/X_1.html',
        u'幼师类': '../../data/zy_63_73_2017/Y_1.html',
        u'医学类': '../../data/zy_63_73_2017/Z_1.html',
        u'采矿类': '../../data/zy_63_73_2017/1_1.html',
    }
}

filed = ['major_code','batch_code','high_school_major','batch_name','number']
if __name__ == '__main__':
    b = Batch()
    for bo in batch_order:
        for k,p in tasks[bo].items():
            data = {}
            data['high_school_major'] = k
            data['major_code'] = os.path.basename(p)[:-5]
            data['batch_code'] = os.path.basename(os.path.dirname(p))
            data['batch_name'],data['number'] = bo.split('_')
            b.insert_into_table(data, 'batch')